[
  {
    "id": 1,
    "title": "Aramark",
    "description": "Aramark is an American food service and facilities services provider to clients in areas including education, prisons, healthcare, business, and leisure. It operates in North America (United States and Canada) and an additional 14 countries, including the United Kingdom, Germany, Chile, Ireland, and Spain. The company is headquartered in Center City, Philadelphia, Pennsylvania. Aramark's revenues totaled US $18.854 billion in 2023, and the company was listed as the 21st largest employer on the Fortune 500.",
    "contributions": "I joined the Aramark project as a Senior Engineer with the Experience Technology team. I was responsible for building a large part of the site's reusable component library, like text blocks, buttons, and responsive image containers. In addition to that, I built numerous components used throughout the site, like carousels, accordions, video players, the main mega menu, and the animated Hero component. I was also in charge of creating a form building engine using react-hook-form and the integration of all forms in the site with Aramark's Salesforce CRM.",
    "technologies": [
      "Javascript",
      "React",
      "React Hook Form",
      "Adobe Experience Manager",
      "Storybook",
      "Salesforce CRM"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by Aramark to build a new website for their company. The new website was built using React, and runs on the Adobe Experience Manager CMS.",
    "client": "Aramark",
    "role": "Senior Engineer - Experience Technology",
    "pImg": "/images/projects/aramark/homepage.png",
    "pImgAlt": "Aramark Homepage",
    "psub1img1": "/images/projects/aramark/psub1img1.png",
    "psub1img1Alt": "Form Building Engine",
    "psub1img2": "/images/projects/aramark/psub1img2.png",
    "psub1img2Alt": "Carousel Component",
    "url": "https://www.aramark.com",
    "type": "agency"
  },
  {
    "id": 2,
    "title": "Masonite",
    "description": "Masonite International Corporation is a designer, manufacturer and distributor of interior and exterior doors for the new construction and repair, renovation and remodeling sectors of the residential and non-residential building construction markets. Founded in 1925 in Laurel, Mississippi, it currently serves approximately customers in 60 countries and is headquartered in Tampa, Florida.",
    "contributions": "I joined the Masonite project as a Senior Engineer with the Experience Technology team. I was responsible for building a large part of the site's reusable component library, like text blocks, buttons, and responsive image containers. In addition to that, I built numerous components used throughout the site, like carousels, accordions, responsive image containers, and video players. I was also in charge of creating a complex Door visualization tool with advanced filtering options built using XState, that allowed the user to browse through the company's door catalog, and the Where to Buy tool, using the Google Maps API, with advanced filtering and search capabilities.",
    "technologies": [
      "Javascript",
      "HTML",
      "CSS",
      "XState",
      "Google Maps API",
      "Optimizely",
      "Storybook"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by Masonite for a complete redesign of their corporate website. The new website was built using vanilla javascript and html templates, running on the Optimizely CMS.",
    "client": "Masonite",
    "role": "Senior Engineer - Experience Technology",
    "pImg": "/images/projects/masonite/homepage.png",
    "pImgAlt": "Masonite Homepage",
    "psub1img1": "/images/projects/masonite/psub1img1.png",
    "psub1img1Alt": "Door Visualization Tool",
    "psub1img2": "/images/projects/masonite/psub1img2.png",
    "psub1img2Alt": "Where to Buy Tool",
    "url": "https://www.masonite.com",
    "type": "agency"
  },
  {
    "id": 3,
    "title": "LPGA",
    "description": "The Ladies Professional Golf Association (LPGA) is an American organization for female golfers. The organization is headquartered at LPGA International in Daytona Beach, Florida, and is best known for running the LPGA Tour, a series of weekly golf tournaments for elite women professional golfers from around the world.",
    "contributions": "I joined the LPGA project as an Engineering Manager with the Experience Technology team. I was part of the original architecture work and designed a custom CMS for the project, which was able to run on both web and mobile platforms using Solito and the Tamagui UI library. I was also in charge of building reusable components for the website, like the athlete's hero page, and of supervising and leading the team of frontend engineers working on the project.",
    "technologies": [
      "Typescript",
      "React Native",
      "NextJS",
      "Tamagui",
      "Solito",
      "Storybook",
      "Team Management"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by the LPGA to build a new website and mobile application for their organization. The new website and mobile app were built using React Native and NextJS, with the components being designed using the Tamagui UI library so they could be completely reused in both platforms.",
    "client": "LPGA",
    "role": "Engineering Manager - Experience Technology",
    "pImg": "/images/projects/lpga/homepage.png",
    "pImgAlt": "LPGA Homepage",
    "url": "https://www.lpga.com",
    "type": "agency"
  },
  {
    "id": 4,
    "title": "Atlantic Health Systems",
    "description": "Atlantic Health System is one of the largest non-profit health care networks in New Jersey. It employs 18,000 people and more than 4,800 affiliated physicians. The system offers more than 400 sites of care, including six hospitals: Chilton Medical Center, Goryeb Children’s Hospital, Hackettstown Medical Center, Morristown Medical Center, Newton Medical Center and Overlook Medical Center.",
    "contributions": "I joined the Atlantic Health Systems project as a Senior Engineer with the Experience Technology team. I was responsible for building a large part of the site's reusable component library, like text blocks, buttons, and responsive image containers. In addition to that, I built numerous components used throughout the site, like carousels, accordions, responsive image containers, and video players. I was also in charge of creating complex Find a Doctor and Find a Location tools, using the Google Maps API and the Coveo search engine.",
    "technologies": [
      "Typescript",
      "React",
      "Adobe Experience Manager",
      "Storybook",
      "Coveo",
      "Google Maps API",
      "SWR"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by Atlantic Health Systems for a complete redesign of their corporate website. The new website was built using React, and runs on the Adobe Experience Manager CMS.",
    "client": "Atlantic Health System",
    "role": "Senior Engineer - Experience Technology",
    "pImg": "/images/projects/ahs/homepage.png",
    "pImgAlt": "AHS Homepage",
    "psub1img1": "/images/projects/ahs/psub1img1.png",
    "psub1img1Alt": "Find a Doctor",
    "psub1img2": "/images/projects/ahs/psub1img2.png",
    "psub1img2Alt": "Find a Location",
    "url": "https://www.atlantichealth.org",
    "type": "agency"
  },
  {
    "id": 7,
    "title": "niikiis",
    "description": "niikiis is the all-in-one HR software that streamlines time tracking and time off management with a time clock feature that provides the best employee experience. Empower your workforce with self-service time management clocking in and out from any place and device. Manage shifts and time by projects, track overtime, and configure and classify breaks with comments. Track employees’ location either on-site or remote with the golocalization integration.",
    "contributions": "During my time at niikiis I built numerous components and sections of the application, including most of the font page, chat service, reporting engine, social feed, shift tracking engine, and micro learning animated video player using AWS Polly and Lottie animations. I was also in charge of mentoring junior team members, and building a mobile solution for attendance tracking, using React Native and Expo, this solution used the company's own API to fetch employeedata, the device's GPS to track the employee's location, and the device's camera for face detection using Tensorflow and AWS Rekognition.",
    "technologies": [
      "Typescript",
      "React",
      "Redux",
      "React Context API",
      "NodeJS",
      "DynamoDB",
      "AWS",
      "Tensorflow",
      "Lottie",
      "AWS Polly",
      "React Native",
      "Expo",
      "Amazon Rekognition",
      "Mentoring",
      "Team Management"
    ],
    "company": "niikiis Knowtion",
    "about": "I joined niikiis as a Senior Frontend Developer to help build the company's HRIS application. The application was built using React, with state management handled by Redux and React's Conext API. The frontend connects to a series of backend microservices built using NodeJS and DynamoDB, and running on Amazon AWS.",
    "client": "niikiis Knowtion",
    "role": "Senior Frontend Developer",
    "pImg": "/images/projects/niikiis/homepage.png",
    "pImgAlt": "niikiis Homepage",
    "psub1img1": "/images/projects/niikiis/psub1img1.png",
    "psub1img1Alt": "Attendance Tracking",
    "psub1img2": "/images/projects/niikiis/psub1img2.png",
    "psub1img2Alt": "Reporting Engine",
    "url": "https://www.niikiis.com",
    "type": "company"
  },
  {
    "id": 8,
    "title": "Magic",
    "description": "A Y Combinator backed company, Magic is a leading modern outsourcing platform that connects SMBs to high-quality remote workers, from SDRs to virtual assistants and more. With roots in Silicon Valley, and backing from top venture capitalists, its workers are supercharged with a combination of the latest AI technology and training.",
    "contributions": "As part of the Labs team, I built a new phone call integration for the company's AI-powered agent, which allowed the model to place phone calls to schedule appointments and services with real-life people and business that lacked an API that would allow them to be scheduled through the Magic platform. This integration was built using GPT, the Twilio API, and a text-to-speech and speech-to-text engine to feed data to the model. The vertical was integrated to the model and other verticals using Autogen and the model was trained to follow a script during the call, with the ability to handle basic questions and tasks, and improvise when needed or when being forced to go off script and handle unexpected situations. I also built an additional vertical that allowed the model to order presents from an online store by connecting to the store's API, this allowed a Magic user to order a present for a friend or family member, and have it delivered to their door.",
    "technologies": [
      "Python",
      "GPT",
      "Twilio API",
      "Text-to-Speech",
      "Speech-to-Text",
      "Autogen",
      "Prompt Engineering"
    ],
    "company": "Magic Inc",
    "about": "I joined Magic as Senior Enginner with the Labs team, where I was in charge of building new integration verticals for the company's AI-powered agent.",
    "client": "Magic Inc",
    "role": "Senior Engineer",
    "pImg": "/images/projects/magic/homepage.png",
    "pImgAlt": "Magic Inc Homepage",
    "url": "https://www.getmagic.com",
    "type": "company",
    "media": {
      "url": "/images/projects/magic/audio.mp3",
      "type": "audio/mpeg",
      "title": "AI Model Demo - Scheduling an Appointment"
    }
  },
  {
    "id": 5,
    "title": "Sprouts Farmers Market",
    "description": "Sprouts Farmers Market, Inc., is a supermarket chain headquartered in Phoenix, Arizona. The grocer offers a wide selection of natural and organic foods, including fresh produce, bulk foods, vitamins and supplements, packaged groceries, meat, poultry, seafood, deli, baked goods, dairy products, frozen foods, natural body care, and household items. Sprouts employs 35,000 workers and operates more than 400 stores in 23 states.",
    "contributions": "I joined the Sprouts project as an Engineering Manager with the Experience Technology team. I was responsible for building part of the new user interface for the website, fixing existing integration issues with third party libraries and providers, handling technical communication with the client, and supervising a team of external contractors.",
    "technologies": [
      "PHP",
      "WordPress",
      "Team Management",
      "Client Communication"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by Sprouts Farmers Market to improve the design of their customer facing website. The website was built using PHP, and ran on the WordPress CMS.",
    "client": "Sprouts Farmers Market",
    "role": "Engineering Manager - Experience Technology",
    "pImg": "/images/projects/sprouts/homepage.png",
    "pImgAlt": "Sprouts Homepage",
    "url": "https://www.sprouts.com",
    "type": "agency"
  },
  {
    "id": 6,
    "title": "Novick Corporation",
    "description": "Novick Corporation is a global leader in transportation, distribution, and delivery serfvices for the foodservice industry. They are headquartered in Philadelphia, and service 11 states across the northeast coast of the United States.",
    "contributions": "I joined the Novick project as a Senior Engineer with the Experience Technology team. I was responsible for building the frontend of the application from the ground up, using NextJS, React, and the Material UI library. The application uses SSO for authentication with Azure AD through a custom MSAL middleware, zustand for state management, react-query for data fetching, and supports dragging and dropping of meals and recipes.",
    "technologies": [
      "Typescript",
      "React",
      "NextJS",
      "Zustand",
      "React Query",
      "Material UI",
      "SSO",
      "Azure AD",
      "MSAL",
      "SSR",
      "SSG"
    ],
    "company": "Hero Digital",
    "about": "Hero Digital was contracted by Novick Corporation to build a new menu planning tool for their b2b customers. This tool handles user management, meal creation, scheduling and ordering, and integrates with the company's own CRM.",
    "client": "Novick Corporation",
    "role": "Senior Engineer - Experience Technology",
    "pImg": "/images/projects/novick/homepage.png",
    "pImgAlt": "Novick Homepage",
    "psub1img1": "/images/projects/novick/psub1img1.png",
    "psub1img1Alt": "Menu Planning",
    "psub1img2": "/images/projects/novick/psub1img2.png",
    "psub1img2Alt": "Meal Details",
    "url": "https://www.novickcorp.com",
    "type": "agency"
  },
  {
    "id": 9,
    "title": "Cranium",
    "description": "Born from KPMG Studio, Cranium is the leading AI governance software provider, enabling organizations to drive security, compliance, and trust across their AI and GenAI systems.",
    "contributions": "I joined the Cranium project as a Senior Engineer with the objective of helping them improve their application's user experience. I was responsible for migrating state management from Redux to Zustand, implementing react-query for API communications, updating the application's React version to the latest stable version, and for improving the application's overall design and accessibility.",
    "technologies": [
      "Typescript",
      "React",
      "Zustand",
      "React Query",
      "ANT Design"
    ],
    "company": "Expand the Room",
    "about": "Expand the Room was contracted by Cranium to make improvements to their client facing AI Governance tool, built using React, Redux, and the ANT Design library",
    "client": "Cranium",
    "role": "Senior Engineer",
    "pImg": "/images/projects/cranium/homepage.png",
    "pImgAlt": "Cranium Homepage",
    "url": "https://www.cranium.ai",
    "type": "agency"
  },
  {
    "id": 10,
    "title": "Prevu",
    "description": "A modern, full-service brokerage and real estate firm, Prevu ranks as the No. 34 fastest growing company in the real estate industry on the Inc. 5000 List. It is on a mission to empower homebuyers and their differentiated, tech-driven approach makes the real estate buying process seamless and more affordable.",
    "contributions": "I joined Prevu's Engineering team as a Senior Engineer to work on improving their application's frontend. This included migrating state management from Redux to React's Context API, implementing react-query for API communications, and rebuilding numerous pages and components to match updated design patterns.",
    "technologies": [
      "Typescript",
      "React",
      "NextJS",
      "Redux",
      "React Query",
      "Context API"
    ],
    "company": "Rockstar Coders",
    "about": "Rockstar Coders was contracted by Prevu to offer staff augmentation of their Engineering team to work on their customer facing Real Estate application. This application was built using React, NextJS, Redux and custom built styling system.",
    "client": "Prevu Real Estate",
    "role": "Senior Engineer",
    "pImg": "/images/projects/prevu/homepage.png",
    "pImgAlt": "Prevu Homepage",
    "url": "https://www.prevu.com",
    "type": "agency"
  },
  {
    "id": 11,
    "title": "Prosprice Generator",
    "description": "The power to price on the spot. Use the barcode scanner to cost out the job - Your suggested retail selling price will instantly appear on the screen. Within seconds, you can now communicate your estimates with your customers & even email their invoice for payment processing.",
    "contributions": "I joined the Prosprice project as a Senior Engineer in charge of building this new mobile application. This application was built using React Native, running on the Expo platform in both iOS and Android, offers a barcode scanner to to scan items and cost out the job using an integration with the BigBox API. It also allows the user to communicate the estimate with the customer and send them an invoice for payment.",
    "technologies": [
      "Typescript",
      "React",
      "React Native",
      "React Query",
      "zustand",
      "Expo",
      "BigBox API"
    ],
    "company": "Rockstar Coders",
    "about": "Rockstar Coders was contracted by Prosprice to develop a new mobile application for their Construction Estimating tool. This application was built using React Native, and runs on the Expo platform.",
    "client": "Prosprice",
    "role": "Senior Engineer",
    "pImg": "/images/projects/prosprice/homepage.png",
    "pImgAlt": "Prosprice Homepage",
    "url": "https://www.prosprice.com",
    "type": "agency"
  }
]
